Repository: Elendil92/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/exploring_maps/attribute_table.po
Languages: pt_pt

source: Attributes Table
pt_pt: Tabela de Atributos

source: When clicking on the |attribute_table_button| button of the :ref:`toc`, the *Attributes Table* panel opens at the bottom of the *Map* page.
pt_pt: Ao clicar no botão |attribute_table_button| do :ref:`toc`, o painel *Tabela de Atributos* abre na parte inferior da página *Mapa*.

source: *The Attributes Table Panel*
pt_pt: *O Painel da Tabela de Atributos*

source: In that panel you can navigate through the features of the layer, zoom to their geometries by clicking on the |zoom_to_feature_icon| icon and explore their attributes.
pt_pt: Neste painel pode navegar pelos recursos da camada, ampliar suas geometrias clicando no ícone |zoom_to_feature_icon| ícone e explorar seus atributos.

source: The *Attribute Tables* has a row for each feature belonging to the layer and a column for each attribute that describes the feature.
pt_pt: As *Tabelas de Atributos* possuem uma linha para cada característica pertencente à camada e uma coluna para cada atributo que descreve a característica.

source: Each column has a *Filter* input field through which you can filter the features basing on some value or expression (depending on the data type of the field).
pt_pt: Cada coluna tem um *Filtro* de campo de entrada por meio do qual pode filtrar os recursos com base em algum valor ou expressão (dependendo do tipo de dados do campo).

source: *Filtering Features by Attribute*
pt_pt: *Recursos de Filtragem por Atributo*

source: The *Attributes Table* panel contains a *Toolbar* which makes you available some useful functionalities.
pt_pt: O painel *Tabela de Atributos* contém uma *Barra de Ferramentas* que disponibiliza algumas funcionalidades úteis.

source: *The Attributes Table Toolbar*
pt_pt: *A Barra de Ferramentas da Tabela de Atributos*

source: Those functionalities are:
pt_pt: Essas funcionalidades são:

source: *Edit Mode*
pt_pt: *Modo de Edição*

source: By clicking on |edit_mode_button| you can start an editing session. It permits you to add new features, to delete or modify the existing ones, to edit geometries. See the :ref:`layer-data-editing` section for further information.
pt_pt: Clicando em |edit_mode_button| pode iniciar uma sessão de edição. Permite adicionar novos recursos, excluir ou modificar os existentes, editar geometrias. Veja a seção :ref:`layer-data-editing` para mais informações.

source: *Advanced Search*
pt_pt: *Busca Avançada*

source: Click on |advanced_search_button|, a new panel opens. That panel allows you to filter features in many different ways. This functionality will be explained in depth in the :ref:`advanced-search` section.
pt_pt: Clique em |advanced_search_button|, irá surgir um novo painel. Esse painel permite filtrar recursos de muitas maneiras diferentes. Esta funcionalidade será explicada em detalhe na secção :ref:`advanced-search`.

source: *Zoom to page extent*
pt_pt: *Zoom na extensão da página*

source: Click on |zoom_to_page_extent_button| to zoom to the page extent.
pt_pt: Clique em |zoom_to_page_extent_button| para ampliar até a extensão da página.

source: *Hide/show columns*
pt_pt: *Ocultar/mostrar colunas*

source: When clicking on |hide_show_columns_button| another panel opens inside the *Attributes Table*. Through that panel you can choose what columns you want to see, see the picture below.
pt_pt: Ao clicar em |hide_show_columns_button| outro painel aparece dentro da *Tabela de Atributos*. Através desse painel pode escolher quais colunas deseja ver, veja a imagem em baixo.

source: *Hide/Show Columns of the Attributes Table*
pt_pt: *Ocultar/Mostrar Colunas da Tabela de Atributos*

source: *Create a chart*
pt_pt: *Crie um gráfico*

source: Through the |create_charts_button| button you can open the *Chart Widgets* panel where many functionalities to describe and visualize the layer data are available (see :ref:`creating-widgets`).
pt_pt: Através do botão |create_charts_button| pode abrir o painel *Widgets de gráfico* onde muitas funcionalidades para descrever e visualizar os dados da camada estão disponíveis (veja :ref:`creating-widgets`).

source: *Sync map with filter*
pt_pt: *Sincronizar mapa com filtro*

source: Click on the |sync_map_with_filter_button| icon to synchronize the map with the filter.
pt_pt: Clique no ícone |sync_map_with_filter_button| para sincronizar o mapa com o filtro.

source: Advanced Search
pt_pt: Busca Avançada

source: As mentioned before, GeoNode allows both an attribute based and spatial filtering. When clicking on |advanced_search_button| from the layer *Attributes Table* the *Advanced Search* panel opens and shows you three different filtering functionalities:
pt_pt: Como mencionado antes, o GeoNode permite uma filtragem espacial e baseada em atributos. Ao clicar em |advanced_search_button| na camada *Tabela de Atributos*, abre o painel *Pesquisa Avançada*, mostrando três funcionalidades de filtragem diferentes:

source: In the **Attribute Filter** section you can compose a series of conditions about the attributes of the layer. Click on |add_condition_button| to insert a new empty condition. Select the attribute you are interested in, select an operator and type a comparison value. You can group conditions through the *Add Group* |add_group_button| button. Click on |start_search_button| to perform the search.
pt_pt: Na secção **Filtro de Atributos**, pode compor uma série de condições sobre os atributos da camada. Clique em |add_condition_button| para inserir uma nova condição em branco. Seleccione o atributo de seu interesse, seleccione um operador e digite um valor de comparação. Você pode agrupar condições através do botão *Adicionar Grupo* |add_group_button|. Clique em |start_search_button| para realizar a pesquisa.

source: *Filtering by Attributes*
pt_pt: *Filtragem por Atributos*

source: You can also decide if *All* the conditions have to be met, if only *Any* or *None* of them (see the red arrow in the picture above).
pt_pt: Pode também decidir se *Todas* as condições devem ser correspondidas ou se apenas *Qualquer* ou *Nenhuma* delas (veja a seta vermelha na imagem em cima).

source: The **Region of interest** filtering allows you to filter features that have some relationship with a spatial region that you draw on the map.
pt_pt: A filtragem de **Região de interesse** permite filtrar recursos que têm alguma relação com uma região espacial desenhada no mapa.

source: Select the *Filter Type* (Circle, Viewport, Polygon or Rectangle), draw the spatial region of interest on the map, select a *Geometric Operation* (Intersects, Bounding Box, Contains or Is contained) and then click on |start_search_button|.
pt_pt: Seleccione o *Tipo de Filtro* (Círculo, Janela de Visualização, Polígono ou Rectângulo), desenhe a região espacial de interesse no mapa, seleccione uma *Operação Geométrica* (Cruzamento, Caixa Delimitadora, Contém ou Está contido) e clique em |start_search_button| .

source: *Filtering by Region Of Interest*
pt_pt: *Filtragem por Região de Interesse*

source: Through the **Layer Filter** you can select only those features which comply with some conditions on other layers of the map. You can also add conditions on attributes for those layers.
pt_pt: Por meio do **Filtro de Camada**, pode seleccionar apenas os recursos que atendem a algumas condições em outras camadas do mapa. Pode também adicionar condições aos atributos dessas camadas.

source: *Layer Filtering*
pt_pt: *Filtragem de Camada*

source: You can read more about the *Attributes Table* and the *Advanced Search* on the `MapStore2 Documentation <https://mapstore2.readthedocs.io/en/latest/user-guide/attributes-table/#advanced-filtering>`_.
pt_pt: Pode ler mais sobre a *Tabela de Atributos* e a *Pesquisa Avançada* no `MapStore2 Documentation <https://mapstore2.readthedocs.io/en/latest/user-guide/attributes-table/#advanced-filtering>`_.
