Repository: Elendil92/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/exploring_maps/creating_widgets.po
Languages: pt_pt

source: Creating Widgets
pt_pt: Criação de Widgets

source: *Widgets* are graphical elements that describe the layers data. They can be of different types such as *Charts*, *Texts*, *Tables* and *Counters*. Through the |create_widgets_button| button of the :ref:`toc` you can open the *Widgets* panel.
pt_pt: *Widgets* são elementos gráficos que descrevem os dados das camadas. Eles podem ser de diferentes tipos, como *Gráficos*, *Textos*, *Tabelas* e *Contadores*. Por meio do |create_widgets_button| do :ref:`toc` pode abrir o painel *Widgets*.

source: *Creating Widgets*
pt_pt: *Criação de Widgets*

source: Chart Widgets
pt_pt: Widgets de Gráfico

source: *Chart Widgets* are graphical representations of the layer data. They can be *Bar Chart*, *Pie Chart* or *Line Chart* as shown in the picture below.
pt_pt: *Chart Widgets* são representações gráficas dos dados da camada. Podem ser do tipo *Gráfico de Barras*, *Gráfico Circular* ou *Gráfico de Linhas* conforme mostrado na imagem em baixo.

source: *Chart Widgets*
pt_pt: *Widgets de Gráfico*

source: Lets create a new **Bar Chart**.
pt_pt: Vamos criar um novo **Gráfico de Barras**.

source: Click on *Bar Chart* then select the *X Attribute*, the *Y Attribute*, the *Operation* and the *Color* do you prefer. You can also display the *Legend*, *Hide the Y axis*, *Hide the grid* and decide what *Label* display into the legend.
pt_pt: Clique em *Gráfico de Barras* e seleccione o *Atributo X*, o *Atributo Y*, a *Operação* e a *Cor* de sua preferência. Pode também, exibir a *Legenda*, *Ocultar o eixo Y*, *Ocultar a tabela* e decidir qual *Rótulo* será exibido na legenda.

source: Now you can filter the data to be considered for the chart by clicking on |advanced_search_button|. We don't need any filter so click |configure_widgets_options_button| to configure other widget options. Insert a *Title* and a *Description* and click on *Save* |save_button|.
pt_pt: Agora pode filtrar os dados a serem considerados para o gráfico clicando em |advanced_search_button|. Não precisamos de nenhum filtro, então clique em |configure_widgets_options_button| para configurar outras opções de widget. Insira um *Título* e uma *Descrição* e clique em *Guardar* |save_button|.

source: *Chart Widgets Creation*
pt_pt: *Criação de Gráficos de Widgets*

source: The green |connect_to_viewport| icon means that the chart is connected to the viewport.
pt_pt: O ícone verde |connect_to_viewport| significa que o gráfico está ligado ao ecrã de visualização.

source: Expanding the options menu of the widget you can *Show the plotted data*, *Edit* the widget or *Delete* it, *Download* the data as a CSV file or *Export* the image of the graph.
pt_pt: Expandindo o menu de opções do widget, você pode *Mostrar os dados renderizados*, *Editar* o widget ou *Excluir*, *Guardar* os dados como um arquivo CSV ou *Exportar* a imagem do gráfico.

source: *Chart Widgets Options*
pt_pt: *Opções de Widgets de Gráfico*

source: Text Widgets
pt_pt: Widgets de Texto

source: If you select *Text* on the *Widgets* panel you can create *Text Widgets*. Add a *Title* and the desired descriptive text, then click on |save_button|.
pt_pt: Se seleccionou *Texto* no painel *Widgets*, poderá criar *Widgets de texto*. Adicione um *Título* e o texto descritivo desejado e clique em |save_button|.

source: *Text Widgets Creation*
pt_pt: *Criação de Widgets de Texto*

source: The resulting widget looks like the following.
pt_pt: O widget resultante se parece com o seguinte.

source: *My Text Widget*
pt_pt: *O meu Widget de Texto*

source: Table Widgets
pt_pt: Widgets de Tabela

source: Through the *Table Widgets* you can add the :ref:`attributes-table` of the layer to the map. You can decide to show a subset of the features, through filters, and you can select one or more columns/attributes.
pt_pt: Através dos *Widgets de Tabela* pode adicionar a :ref:`tabela-de-atributos` da camada ao mapa. Pode decidir mostrar um subconjunto dos recursos, por meio de filtros, e pode seleccionar uma ou mais colunas/atributos.

source: So, choose what attributes you are interested in and click on |configure_widgets_options_button|.
pt_pt: Portanto, escolha em quais atributos está interessado e clique em |configure_widgets_options_button|.

source: *Table Widgets Columns*
pt_pt: *Colunas de Widgets de Tabela*

source: Insert *Title* and *Description* (optional) and click on |save_button|. The example below shows the *Table Widget* on the map.
pt_pt: Insira *Título* e *Descrição* (opcional) e clique em |save_button|. O exemplo em baixo mostra o *Widget de Tabela* no mapa.

source: *Table Widget*
pt_pt: *Widget de Tabela*

source: Counter Widgets
pt_pt: Widgets de Contador

source: *Counter Widgets* are numeric representations of some attributes. For example you can represent the average speed limit on a road network.
pt_pt: *Counter Widgets* são representações numéricas de alguns atributos. Por exemplo, pode representar o limite de velocidade média em uma rede rodoviária.

source: *Counter Widget Creation*
pt_pt: *Criação de Widget de Contador*

source: Click on |configure_widgets_options_button|, insert *Title* and *Description* then click on |save_button|.
pt_pt: Clique em |configure_widgets_options_button|, insira *Título* e *Descrição* e clique em |save_button|.

source: *Counter Widget*
pt_pt: *Widget de Contador*

source: The GeoNode map viewer is `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_ based, see the `MapStore Documentation <https://mapstore2.readthedocs.io/en/latest/user-guide/widgets/>`_ for further information.
pt_pt: O visualizador de mapas GeoNode é baseado em `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_, veja `MapStore Documentation <https://mapstore2.readthedocs.io/en/latest/user-guide/widgets/>`_ para mais informações.
