Repository: Elendil92/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/exploring_maps/options_menu.po
Languages: pt_pt

source: Options Menu Tools
pt_pt: Ferramentas do Menu de Opções

source: At the top-right corner of the *Map* there is a *Burger Menu* button |burger_menu_button|. Click on it to open the *Map Options* panel.
pt_pt: No canto superior direito do *Mapa* existe o botão *Menu Burger* |burger_menu_button|. Clique nele para abrir o painel *Opções do Mapa*.

source: *The Map Options Menu*
pt_pt: *O Menu de Opções do Mapa*

source: We will explain those tools more in depth in the next paragraphs.
pt_pt: Explicaremos estas ferramentas com mais detalhes nos próximos parágrafos.

source: Printing a Map
pt_pt: Imprimindo um Mapa

source: The `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_ based map viewer of GeoNode allows you to print your map with a customizable layout.
pt_pt: O visualizador de mapa do GeoNode baseado em `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_ permite imprimir o seu mapa com um layout personalizado.

source: Click the :guilabel:`PRINT` option from the *Map Options Menu*, the **Printing Window** will open.
pt_pt: Clique na opção :guilabel:`PRINT` do *Menu de Opções do Mapa*, a **Janela de Impressão** será aberta.

source: *The Printing Window*
pt_pt: *A janela de Impressão*

source: From this window you can:
pt_pt: Nessa janela, você pode:

source: enter *Title* and *Description*;
pt_pt: insirir *Título* e *Descrição*;

source: choose the *Resolution* in dpi;
pt_pt: escolher a *Resolução* em ppp;

source: customize the *Layout*
pt_pt: personalizar o *Layout*

source: the *Sheet size* (A3, A4);
pt_pt: o *Tamanho da folha* (A3, A4);

source: if include the legend or not;
pt_pt: se inclui ou não a legenda;

source: if to put the legend in a separate page;
pt_pt: se colocar a legenda numa página separada;

source: the page *Orientation* (Landscape or Portrait);
pt_pt: a *Orientação* da página (Paisagem ou Retrato);

source: customize the *Legend*
pt_pt: personalizar a *Legenda*

source: the *Label Font*;
pt_pt: o *Rótulo da Fonte*;

source: the *Font Size*;
pt_pt: the *Tamanho da Fonte*;

source: the *Font Emphasis* (bold, italic);
pt_pt: a *Ênfase na Fonte* (negrito, itálico);

source: if *Force Labels*;
pt_pt: se *Forçar Rótulos*;

source: if use *Anti Aliasing Font*;
pt_pt: se usar *Fonte Anti-aliasing*;

source: the *Icon Size*;
pt_pt: o *Tamanho do Ícone*;

source: the *Legend Resolution* in dpi.
pt_pt: a *Resolução de Legenda* em ppp.

source: To print the map click on :guilabel:`Print`.
pt_pt: Para imprimir o mapa clique em :guilabel:`Print`.

source: The Layers Catalog
pt_pt: O Catálogo de Camadas

source: All the layers available in GeoNode, both uploaded and remote, can be loaded on the map through the *Catalog*. Click on the :guilabel:`CATALOG` option of the *Map Options Menu* to take a look at the catalog panel.
pt_pt: Todas as camadas disponíveis no GeoNode, carregadas e remotas, podem ser adicionadas ao mapa através do *Catálogo*. Clique na opção :guilabel:`CATALOG` do *Menu de Opções do Mapa* para visualizar o painel do catálogo.

source: *The Layers Catalog*
pt_pt: *O Catálogo de Camadas*

source: You can navigate through layers and look at their *Thumbnail* images, *Title*, *Description* and *Abstract*. Click on :guilabel:`Add To Map` to load a layer into the map, it will be also visible in the :ref:`toc`.
pt_pt: Pode navegar pelas camadas e ver suas imagens em *Miniatura*, *Título*, *Descrição* e *Resumo*. Clique em :guilabel:`Add To Map` para carregar uma camada no mapa, ela também estará visível em :ref:`toc`.

source: Performing Measurements
pt_pt: Executando Medições

source: Click on the :guilabel:`MEASURE` option of the *Map Options Menu* to perform a measurement. As you can see in the picture below, this tool allows you to measure *Distances*, *Areas* and the *Bearing* of lines.
pt_pt: Clique na opção :guilabel:`MEASURE` do *Menu de Opções do Mapa* para realizar uma medição. Como pode ver na imagem em baixo, esta ferramenta permite medir *Distâncias*, *Áreas* e o *Rumo* das linhas.

source: *The Measure Tool*
pt_pt: *A Ferramenta de Medição*

source: To perform a measure draw on the map the geometry you are interested in, the result will be displayed on the left of the unit of measure select menu (this tool allows you to change the unit of measure also).
pt_pt: Para realizar uma medida, desenhe no mapa a geometria de seu interesse, o resultado será exibido à esquerda do menu de selecção da unidade de medida (esta ferramenta também permite alterar a unidade de medida).

source: *Measuring Areas*
pt_pt: *Medição de Áreas*

source: Saving a map
pt_pt: Salvando um mapa

source: Once all the customizations have been carried out, you can *Save* your map by clicking on the :guilabel:`SAVE AS` option of the *Map Options Menu*.
pt_pt: Uma vez que todas as personalizações tenham sido realizadas, pode *Salvar* seu mapa clicando na opção :guilabel:`SAVE AS` do *Menu de Opções do Mapa*.

source: A new popup window will open.
pt_pt: Uma nova janela pop-up será aberta.

source: *Saving Maps*
pt_pt: *Salvando Mapas*

source: You have to fill out a *Title* and an optional *Description*, then click on :guilabel:`Save`. The page will reload and your map should be visible in the :ref:`finding-maps` list.
pt_pt: Deve preencher um *Título* e uma *Descrição* opcional, a seguir clicar em :guilabel:`Save`. A página será recarregada e o seu mapa deverá estar visível na lista :ref:`finding-maps`.

source: *Your Map into the List*
pt_pt: *O seu Mapa na lista*
