Repository: Elendil92/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/exploring_maps/timeline.po
Languages: pt_pt

source: Timeline
pt_pt: Linha do tempo

source: GeoNode can manage layers with a *time dimension*. Those vector layer may vary their data through time so it is useful to represent that variation on the map.
pt_pt: O GeoNode pode gerir camadas com uma *dimensão de tempo*. Essas camadas vectoriais podem variar seus dados ao longo do tempo, portanto, é útil representar essa variação no mapa.

source: The `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_ based map viewer used in Geonode makes available the **Timeline** tool which allows you to observe the layers' evolution over time, to inspect the layer configuration at a specific time instant and to view different layer configurations time by time dynamically through animations (see the `MapStore Documentation <https://mapstore2.readthedocs.io/en/latest/user-guide/timeline/>`_ for further details).
pt_pt: O visualizador de mapa baseado em `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_ usado no Geonode, disponibiliza a ferramenta **Linha de Tempo** que permite observar a evolução das camadas ao longo do tempo, para inspeccionar a configuração da camada num dado instante de tempo específico e para visualizar as diferentes configurações de camada dinamicamente por meio de animações (consulte a `Documentação do MapStore <https://mapstore2.readthedocs.io/en/latest/user-guide/timeline/>`_ para mais detalhes).

source: Timeline actually works only with WMTS-Multidim extension (WMS time in capabilities is not fully supported).
pt_pt: A linha do tempo na realidade funciona apenas com a extensão WMTS-Multidim (o tempo WMS em capacidades não é totalmente suportado).

source: When loading a temporal layer into the map, the *Timeline* opens automatically.
pt_pt: Ao carregar uma camada temporal para o mapa, a *Linha do tempo* abre automaticamente.

source: *The Timeline*
pt_pt: *A Linha do Tempo*

source: On the left side of the *Timeline* panel you can set the time value in which you want to observe the data. You can type it directly filling out the corresponding input fields or by using the up/down arrows.
pt_pt: No lado esquerdo do painel *Linha do tempo*, pode definir o valor de tempo no qual deseja observar os dados. Pode digitá-lo directamente preenchendo os campos de entrada correspondentes ou usando as setas para cima/para baixo.

source: *The Time Control Buttons*
pt_pt: *Os Botões de Controle de Tempo*

source: On the other side there are the buttons responsible for managing the animations.
pt_pt: Do outro lado estão os botões responsáveis para gerir as animações.

source: In particular you can *Play* the animation by clicking |play_button|, go back to the previous time instant through |time_go_backward_button|, go forward to next time step using |time_go_forward_button| and stop the animation by clicking |stop_button|.
pt_pt: Em particular, pode *Reproduzir* a animação clicando em |play_button|, voltar ao instante anterior através de |time_go_backward_button|, avançar para a próxima etapa usando |time_go_forward_button| e parar a animação clicando em |stop_button|.

source: *The Animation Control Buttons*
pt_pt: *Os Botões de Controle de Animação*

source: The *Timeline* panel can be expanded through the |expand_timeline_button| button.
pt_pt: O painel *Linha do Tempo* pode ser expandido por meio do botão |expand_timeline_button|.

source: *The Expanded Timeline*
pt_pt: * A Linha do Tempo Expandida*

source: The expanded section of the *Timeline* panel contains the *Time Layers List* and an *Histogram* which shows you:
pt_pt: A secção expandida do painel *Linha do tempo* contém a *Lista de camadas de tempo* e um *Histograma* que mostra:

source: the distribution of the data over time
pt_pt: a distribuição dos dados ao longo do tempo

source: *The Timeline Histogram*
pt_pt: *O Histograma da Linha do Tempo*

source: the *Time Cursor*
pt_pt: o *Cursor de Tempo*

source: *The Time Cursor*
pt_pt: *O Cursor de Tempo*

source: You can show/hide the layers list by clicking |show_hide_layers_list_button| (it is active by default).
pt_pt: Pode mostrar/ocultar a lista de camadas clicando em |show_hide_layers_list_button| (está activo por padrão).

source: Through the *Time Range* function you can observe the data in a finite temporal interval. Click on |time_range_button| and set the initial and the final times to use it.
pt_pt: Por meio da função *Intervalo de Tempo*, pode observar os dados num intervalo temporal finito. Clique em |time_range_button| e defina os tempos inicial e final para usá-lo.

source: *The Time Range Settings*
pt_pt: *As Configurações de Intervalo de Tempo*

source: Animations
pt_pt: Animações

source: The *Timeline* allows you to see the data configurations (one for each time in which the data are defined) through ordered sequences of steps.
pt_pt: A *Linha do tempo* permite que veja as configurações de dados (uma para cada vez em que os dados são definidos) por meio de sequências ordenadas de etapas.

source: As said before, you can play the resulting *Animation* by clicking the play button |play_button|. The layer data displayed on map will change accordingly to the time reach by the cursor on the *Histogram*.
pt_pt: Como dito anteriormente, pode reproduzir a *Animação* resultante clicando no botão reproduzir |play_button|. Os dados da camada exibidos no mapa serão alterados de acordo com o tempo alcançado pelo cursor no *Histograma*.

source: By clicking on |animation_settings_button| you can manage some *Animation Settings*.
pt_pt: Clicando em |animation_settings_button| pode gerir algumas *Configurações de Animação*.

source: *The Timeline Settings*
pt_pt: *As Configurações da Linha do Tempo*

source: You can activate the *Snap to guide layer* so that the time cursor will snap to the selected layer's data. You can also set up the *Frame Duration* (by default 5 seconds).
pt_pt: Pode activar *Pular para a camada de guia* para que o cursor de tempo se encaixe nos dados da camada seleccionada. Pode também configurar a *Duração do quadro* (por padrão, 5 segundos).

source: If the *Snap to guide layer* option is disabled, you can force the animation step to be a fixed value.
pt_pt: Se a opção *Ajustar à camada de guia * estiver desabilitada, pode forçar a etapa da animação a ser um valor fixo.

source: The *Animation Range* option lets you to define a temporal range within which the time cursor can move. See the following gif to better understand how the *Animation* works or take a look at the `MapStore Documentation <https://mapstore2.readthedocs.io/en/latest/user-guide/timeline/>`_.
pt_pt: A opção *Intervalo de Animação* permite definir um intervalo temporal dentro do qual o cursor de tempo pode se mover. Veja o seguinte gif para compreender melhor como a *Animação* funciona ou verifique na `Documentação do MapStore <https://mapstore2.readthedocs.io/en/latest/user-guide/timeline/>`_.

source: *The Timeline Animation*
pt_pt: *A Animação da Linha do Tempo*
