Repository: Elendil92/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/exploring_maps/toc.po
Languages: pt_pt

source: Table of Contents (TOC)
pt_pt: Índice (TOC)

source: In the upper left corner, click on |toc_button| to open the *Table Of Contents*, briefly *TOC* from now on, of the map. The *TOC* shows all the layers involved with the *Map* and allows to manage their properties and representations on the map.
pt_pt: No canto superior esquerdo, clique em |toc_button| para abrir o *Índice*, abreviadamente *TOC* de agora em diante, do mapa. O *TOC* mostra todas as camadas envolvidas com o *Mapa* e permite gerir as suas propriedades e representações no mapa.

source: *The Table Of Contents (TOC)*
pt_pt: *O Índice (TOC)*

source: From the *TOC* you can:
pt_pt: A partir do *TOC* pode:

source: manage the layers *Overlap*;
pt_pt: gerir a *Sobreposição* das camadas ;

source: filter the layers list by typing text in the *Filter Layers* field;
pt_pt: filtre a lista de camadas digitando texto no campo *Camadas de filtro*;

source: add new layers from the *Catalog* by clicking the :guilabel:`Add Layer` button;
pt_pt: adicione novas camadas do *Catálogo* clicando no botão :guilabel:`Add Layer`;

source: manage the layers properties such as *Opacity* (scroll the opacity cursor), *Visibility* (click on |hide_button| to make the layer not visible, click on |show_button| to show it on map);
pt_pt: gerir as propriedades das camadas como *Opacidade* (role o cursor de opacidade), *Visibilidade* (clique em |hide_button| para tornar a camada invisível, clique em |show_button| para mostrá-la no mapa);

source: manage the *Layer Settings*, see the next paragraph.
pt_pt: gerir as *Configurações de Camada*, consulte o próximo parágrafo.

source: *Scrolling the Layer Opacity*
pt_pt: *Rolagem da Camada de Opacidade*

source: Select a *Layer* from the list and click on it, the *Layer Toolbar* should appear in the *TOC*.
pt_pt: Seleccione uma *Camada* da lista e clique nela, a *Barra de Ferramentas da Camada* deve aparecer no *TOC*.

source: *The Layer Toolbar*
pt_pt: *A Barra de Ferramentas da Camada*

source: The *Toolbar* shows you many buttons:
pt_pt: A *Barra de Ferramentas* mostra muitos botões:

source: |zoom_to_layer_extent_button| allows you to zoom to the layer extent;
pt_pt: |zoom_to_layer_extent_button| permite ampliar até a extensão da camada;

source: |layer_settings_button| drives you through the layer settings customization (see the next paragraph);
pt_pt: |layer_settings_button| guia-o através da personalização de configurações de camada (consulte o próximo parágrafo);

source: |attribute_table_button| to explore the features of the layer and their attributes (more information at :ref:`attributes-table`);
pt_pt: |attribute_table_button| para explorar os recursos da camada e seus atributos (mais informações em :ref:`tabela-de-atributos`);

source: |delete_layer_button| to delete layers (click on :guilabel:`Delete Layer` to confirm your choice);
pt_pt: |delete_layer_button| para excluir camadas (clique em :guilabel:`Delete Layer` para confirmar a sua escolha);

source: *Deleting Layers*
pt_pt: *Excluindo Camadas*

source: |create_widgets_button| to create *Widgets* (see :ref:`creating-widgets`).
pt_pt: |create_widgets_button| para criar *Widgets* (veja :ref:`creating-widgets`).

source: Managing Layer Settings
pt_pt: Fazendo a Gestão de Configurações de Camada

source: The *Layer Settings* panel looks like the one below.
pt_pt: O painel *Configurações de Camada* é semelhante ao painel abaixo.

source: *The Layer Settings Panel*
pt_pt: *O Painel de Configurações de Camada*

source: The *Layer Settings* are divided in three groups:
pt_pt: As *Configurações de Camada* são divididas em três grupos:

source: *General* settings
pt_pt: Configurações *Gerais*

source: *Display* settings
pt_pt: Configurações do *Visualizador*

source: *Style* settings
pt_pt: Configurações de *Estilo*

source: In the **General** tab of the *Settings Panel* you can customize the layer *Title*, insert a *Description* and change/create the *Layer Group*.
pt_pt: Na guia **Geral** do *Painel de Configurações*, pode personalizar a camada *Título*, inserir uma *Descrição* e alterar/criar o *Grupo de Camadas*.

source: Click on the **Display** tab to see what are the layer appearance properties you can configure.
pt_pt: Clique na guia **Display** para ver quais são as propriedades de aparência da camada que pode configurar.

source: *The Layer Display Settings Panel*
pt_pt: *O Painel de Configurações de Exibição da Camada*

source: The *Format* field allows you to change the output format of the WMS requests.
pt_pt: O campo *Formato* permite que altere o formato de saída das solicitações WMS.

source: You can set a numeric value of *Opacity* using the corresponding input field.
pt_pt: Pode definir um valor numérico de *Opacidade* usando o campo de entrada correspondente.

source: You can also set the layer as *Transparent*, decide to *Use cache options* and to use *Single Tile*.
pt_pt: Pode, também, definir a camada como *Transparente*, decidir *Usar opções de cache* e usar *Bloco Único*.

source: The third tab is the **Style** one. By clicking on it, an advanced *Style Editor* allows you to create new styles and to modify or delete an existing one. See the :ref:`layer-style` section to read more.
pt_pt: A terceira guia é **Estilo**. Ao clicar nela, um *Editor de Estilos* avançado permite criar novos estilos e modificar ou excluir um existente. Veja a secção :ref:`layer-style` para ler mais.
